motrice_final_0_box_1x05_meno30perc/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

fieldAverage
{
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    fields 
    ( 
        U
        {
            mean           yes;
            prime2Mean     no
            base           iteration;
        }
    )
     
     restartOnRestart     false;
     restartOnOutput      false;
     periodicRestart      false;
     restartPeriod       0.002;

     region        region0;
     enabled       true;
     log           true;
     timeStart       0;
     timeEnd       300;
     executeControl timeStep;
     executeInterval 1;
     writeControl   timeStep;
     writeInterval     1;
}


// ************************************************************************* //
